<html>
<head>
</head>
<body>
Copyright 2003 Sun Microsystems, Inc. 4150   Network Circle, Santa Clara,
  California, 95054, U.S.A. <br>
<br>
All rights reserved. <br>
<br>
 This product or document is protected by copyright and distributed under
licenses restricting its use, copying, distribution, and decompilation. 
No part of this product or related documentation may be reproduced in any
form by any means without prior written authorization of Sun and its licensors,
if any.  Third party software, including font technology, is copyrighted
and licensed from Sun suppliers.  Sun, Sun Microsystems, the Sun Logo, and
Java  are trademarks or registered trademarks of Sun Microsystems, Incin
the U.S.  and other countries.    All SPARC trademarks are used under license
and are trademarks or registered trademarks of SPARC International, Inc.
in the U.S. and other countries. Products bearing SPARC trademarks are based
upon an architecture developed by Sun Microsystems, Inc.   PostScript is
a registered trademark of Adobe Systems, Inc.  DOCUMENTATION IS PROVIDED
"AS IS" AND ALL EXPRESS OR IMPLIED CONDITIONS. REPRESENTATIONS AND WARRANTIES,
INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH 
DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.<br>
<br>
    ------------------------------------------------------------------------- 
 <br>
<br>
Copyright 2003 Sun Microsystems, Inc., 4150   Network Circle,  Santa Clara,
  California, 95054, U.S.A.  Etats-Unis. <br>
Tous droits r&eacute;serv&eacute;s.  <br>
<br>
Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute;
avec des licences qui en restreignent l'utilisation, la copie, la distribution,
et la d&eacute;compilation.  Aucune partie de ce produit ou document ne peut
&ecirc;tre reproduite sous aucune forme, par quelque moyen que ce soit, sans
l'autorisation pr&eacute;alable et &eacute;crite de Sun et de ses bailleurs
de licence, s'il y en a.  Le logiciel d&eacute;tenu par des tiers, et qui
comprend la technologie relative aux polices de caract&egrave;res, est prot&eacute;g&eacute;
par un copyright et licenci&eacute; par des fournisseurs de Sun.   Sun, Sun
Microsystems, le logo Sun, et Java sont des marques de fabrique ou des marques
d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d'autres
pays.    Toutes les marques SPARC sont utilis&eacute;es sous licence et sont
des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International, 
Inc. aux Etats-Unis et dans d'autres pays.  Les produits portant les marques
SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par
Sun Microsystems, Inc.   Postcript est une marque enregistr&eacute;e d'Adobe
Systems, Inc.  LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES
CONDITIONS, D&Eacute;CLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT 
EXCLUES DANS LA MESURE AUTORIS&Eacute;E PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT
TOUTE GARANTIE IMPLICITE RELATIVE &Agrave; LA QUALIT&Eacute; MARCHANDE, &Agrave; 
L'APTITUDE &Agrave; UNE UTILISATION PARTICULI&Egrave;RE OU &Agrave; L'ABSENCE
DE CONTREFA&Ccedil;ON.  
</body>
</html>
